Ran Plan for 2 projects:

1. project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`
1. project: `datadog/integration` dir: `datadog/integration` workspace: `default`

### 1. project: `iam/zerone-id` dir: `terraform/iam/zerone-id` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create
~ update in-place

Terraform will perform the following actions:

  # aws_iam_role.DatadogAWSIntegrationRole will be created
+ resource "aws_iam_role" "DatadogAWSIntegrationRole" {
      + arn                   = (known after apply)
      + assume_role_policy    = jsonencode(
            {
              + Statement = [
                  + {
                      + Action    = "sts:AssumeRole"
                      + Condition = {
                          + StringEquals = {
                              + "sts:ExternalId" = "464622532012"
                            }
                        }
                      + Effect    = "Allow"
                      + Principal = {
                          + AWS = "arn:aws:iam::464622532012:root"
                        }
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + create_date           = (known after apply)
      + force_detach_policies = false
      + id                    = (known after apply)
      + managed_policy_arns   = (known after apply)
      + max_session_duration  = 3600
      + name                  = "DatadogAWSIntegrationRole"
      + name_prefix           = (known after apply)
      + path                  = "/"
      + tags_all              = (known after apply)
      + unique_id             = (known after apply)
    }

  # aws_iam_role.app_demoapp will be updated in-place
~ resource "aws_iam_role" "app_demoapp" {
      ~ assume_role_policy    = jsonencode(
          ~ {
              ~ Statement = [
                  ~ {
                      ~ Action    = "sts:AssumeRoleWithWebIdentity" -> "sts:AsumeRole"
                      - Condition = {
                          - StringEquals = {
                              - "oidc.eks.ap-northeast-2.amazonaws.com/id/C9A89550F7EB2C2F7BE9C86E19442CF4:aud" = "sts.amazonaws.com"
                            }
                        }
                      ~ Principal = {
                          - Federated = "arn:aws:iam::066346343248:oidc-provider/oidc.eks.ap-northeast-2.amazonaws.com/id/C9A89550F7EB2C2F7BE9C86E19442CF4"
                          + Service   = "ec2.amazonaws.com"
                        }
                        # (1 unchanged attribute hidden)
                    },
                ]
                # (1 unchanged attribute hidden)
            }
        )
        id                    = "app-demoapp"
        name                  = "app-demoapp"
        tags                  = {}
        # (8 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # aws_iam_role_policy.DatadogAWSIntegrationRole_operation will be created
+ resource "aws_iam_role_policy" "DatadogAWSIntegrationRole_operation" {
      + id          = (known after apply)
      + name        = "minimum-DatadogAWSIntegrationRole-operation-access"
      + name_prefix = (known after apply)
      + policy      = jsonencode(
            {
              + Statement = [
                  + {
                      + Statement = [
                          + {
                              + Action   = [
                                  + "apigateway:GET",
                                  + "autoscaling:Describe*",
                                  + "backup:List*",
                                  + "budgets:ViewBudget",
                                  + "cloudfront:GetDistributionConfig",
                                  + "cloudfront:ListDistributions",
                                  + "cloudtrail:DescribeTrails",
                                  + "cloudtrail:GetTrailStatus",
                                  + "cloudtrail:LookupEvents",
                                  + "cloudwatch:Describe*",
                                  + "cloudwatch:Get*",
                                  + "cloudwatch:List*",
                                  + "codedeploy:List*",
                                  + "codedeploy:BatchGet*",
                                  + "directconnect:Describe*",
                                  + "dynamodb:List*",
                                  + "dynamodb:Describe*",
                                  + "ec2:Describe*",
                                  + "ec2:GetTransitGatewayPrefixListReferences",
                                  + "ec2:SearchTransitGatewayRoutes",
                                  + "ecs:Describe*",
                                  + "ecs:List*",
                                  + "elasticache:Describe*",
                                  + "elasticache:List*",
                                  + "elasticfilesystem:DescribeFileSystems",
                                  + "elasticfilesystem:DescribeTags",
                                  + "elasticfilesystem:DescribeAccessPoints",
                                  + "elasticloadbalancing:Describe*",
                                  + "elasticmapreduce:List*",
                                  + "elasticmapreduce:Describe*",
                                  + "es:ListTags",
                                  + "es:ListDomainNames",
                                  + "es:DescribeElasticsearchDomains",
                                  + "events:CreateEventBus",
                                  + "fsx:DescribeFileSystems",
                                  + "fsx:ListTagsForResource",
                                  + "health:DescribeEvents",
                                  + "health:DescribeEventDetails",
                                  + "health:DescribeAffectedEntities",
                                  + "kinesis:List*",
                                  + "kinesis:Describe*",
                                  + "lambda:GetPolicy",
                                  + "lambda:List*",
                                  + "logs:DeleteSubscriptionFilter",
                                  + "logs:DescribeLogGroups",
                                  + "logs:DescribeLogStreams",
                                  + "logs:DescribeSubscriptionFilters",
                                  + "logs:FilterLogEvents",
                                  + "logs:PutSubscriptionFilter",
                                  + "logs:TestMetricFilter",
                                  + "oam:ListSinks",
                                  + "oam:ListAttachedLinks",
                                  + "organizations:Describe*",
                                  + "organizations:List*",
                                  + "rds:Describe*",
                                  + "rds:List*",
                                  + "redshift:DescribeClusters",
                                  + "redshift:DescribeLoggingStatus",
                                  + "route53:List*",
                                  + "s3:GetBucketLogging",
                                  + "s3:GetBucketLocation",
                                  + "s3:GetBucketNotification",
                                  + "s3:GetBucketTagging",
                                  + "s3:ListAllMyBuckets",
                                  + "s3:PutBucketNotification",
                                  + "ses:Get*",
                                  + "sns:List*",
                                  + "sns:Publish",
                                  + "sns:GetSubscriptionAttributes",
                                  + "sqs:ListQueues",
                                  + "states:ListStateMachines",
                                  + "states:DescribeStateMachine",
                                  + "support:DescribeTrustedAdvisor*",
                                  + "support:RefreshTrustedAdvisorCheck",
                                  + "tag:GetResources",
                                  + "tag:GetTagKeys",
                                  + "tag:GetTagValues",
                                  + "wafv2:ListLoggingConfigurations",
                                  + "wafv2:GetLoggingConfiguration",
                                  + "xray:BatchGetTraces",
                                  + "xray:GetTraceSummaries",
                                ]
                              + Effect   = "Allow"
                              + Resource = "*"
                            },
                        ]
                    },
                ]
              + Version   = "2012-10-17"
            }
        )
      + role        = (known after apply)
    }

Plan: 2 to add, 1 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p iam/zerone-id`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fterraform%252Fiam%252Fzerone-id%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p iam/zerone-id`
</details>
Plan: 2 to add, 1 to change, 0 to destroy.

---
### 2. project: `datadog/integration` dir: `datadog/integration` workspace: `default`
<details><summary>Show Output</summary>

```diff

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
+ create

Terraform will perform the following actions:

  # datadog_integration_aws.sandbox will be created
+ resource "datadog_integration_aws" "sandbox" {
      + account_id                           = "066346343248"
      + account_specific_namespace_rules     = {
          + "auto_scaling" = false
          + "opsworks"     = false
        }
      + cspm_resource_collection_enabled     = (known after apply)
      + excluded_regions                     = [
          + "us-east-1",
          + "us-west-2",
        ]
      + extended_resource_collection_enabled = (known after apply)
      + external_id                          = (known after apply)
      + host_tags                            = [
          + "accountId:066346343248",
          + "accountAlias:zerone-id",
        ]
      + id                                   = (known after apply)
      + metrics_collection_enabled           = (known after apply)
      + resource_collection_enabled          = (known after apply)
      + role_name                            = "DatadogAWSIntegrationRole"
    }

Plan: 1 to add, 0 to change, 0 to destroy.

```

* :arrow_forward: To **apply** this plan, comment:
    * `atlantis apply -p datadog/integration`
* :put_litter_in_its_place: To **delete** this plan click [here](https://atlantis.terraform.devart.tv/lock?id=DevopsArtFactory%252Fterraform-provisioning%252Fdatadog%252Fintegration%252Fdefault)
* :repeat: To **plan** this project again, comment:
    * `atlantis plan -p datadog/integration`
</details>
Plan: 1 to add, 0 to change, 0 to destroy.

---
* :fast_forward: To **apply** all unapplied plans from this pull request, comment:
    * `atlantis apply`
* :put_litter_in_its_place: To delete all plans and locks for the PR, comment:
    * `atlantis unlock`
